from random import choice, random, randint

from loremipsum import get_sentences
from datetime import datetime, timedelta

male_first_names = ['Адам', 'Александр', 'Алексей', 'Альберт', 'Андрей', 'Антон', 'Арсений', 'Артём', 'Артемий', 'Артур', 'Вадим', 'Василий', 'Владимир', 'Владислав', 'Всеволод', 'Георгий', 'Глеб', 'Григорий', 'Давид', 'Дамир', 'Даниил', 'Данила', 'Денис', 'Дмитрий', 'Евгений', 'Егор', 'Елисей', 'Захар', 'Иван', 'Игорь', 'Илья', 'Кирилл', 'Константин', 'Лев', 'Леон', 'Макар', 'Максим', 'Марат', 'Марк', 'Марсель', 'Матвей', 'Мирослав', 'Михаил', 'Никита', 'Николай', 'Павел', 'Пётр', 'Роберт', 'Родион', 'Роман', 'Савелий', 'Святослав', 'Семён', 'Сергей', 'Станислав', 'Степан', 'Тимофей', 'Тимур', 'Тихон', 'Фёдор', 'Эмин', 'Эмир', 'Эрик', 'Юрий', 'Ян', 'Ярослав']
male_last_names = ['Абрамов', 'Агеев', 'Акимов', 'Александров', 'Алехин', 'Андреев', 'Анисимов', 'Артамонов', 'Афанасьев', 'Баранов', 'Белов', 'Беляков', 'Бессонов', 'Богданов', 'Борисов', 'Вавилов', 'Васильев', 'Вешняков', 'Виноградов', 'Вишневский', 'Владимиров', 'Власов', 'Волков', 'Воробьев', 'Воронин', 'Гаврилов', 'Голованов', 'Голубев', 'Гончаров', 'Горбунов', 'Горшков', 'Грачев', 'Григорьев', 'Громов', 'Гусев', 'Давыдов', 'Данилов', 'Демидов', 'Демин', 'Денисов', 'Дмитриев', 'Дорохов', 'Дроздов', 'Дубинин', 'Дубровин', 'Дьяков', 'Дьяконов', 'Евдокимов', 'Егоров', 'Еремеев', 'Еремин', 'Ермаков', 'Ермолов', 'Ефимов', 'Ефремов', 'Жданов', 'Жилин', 'Жуков', 'Журавлев', 'Зайцев', 'Захаров', 'Зверев', 'Зеленин', 'Золотов', 'Зубов', 'Зыков', 'Иванов', 'Ильин', 'Казаков', 'Карпов', 'Кириллов', 'Киселев', 'Климов', 'Клюев', 'Ковалев', 'Кожевников', 'Козин', 'Козлов', 'Козырев', 'Колесников', 'Колосов', 'Кольцов', 'Комаров', 'Кондратьев', 'Коновалов', 'Кононов', 'Королев', 'Коротков',
                   'Корчагин', 'Коршунов', 'Котов', 'Крюков', 'Кудрявцев', 'Кузин', 'Кузнецов', 'Кукушкин', 'Куликов', 'Лазарев', 'Лебедев', 'Леонов', 'Логинов', 'Лыков', 'Майоров', 'Макаров', 'Максимов', 'Малышев', 'Мальцев', 'Маркин', 'Масленников', 'Маслов', 'Матвеев', 'Медведев', 'Мельников', 'Мещеряков', 'Миронов', 'Митрофанов', 'Михайлов', 'Михеев', 'Морозов', 'Муравьев', 'Назаров', 'Наумов', 'Некрасов', 'Нефедов', 'Никитин', 'Никифоров', 'Николаев', 'Новиков', 'Овчинников', 'Озеров', 'Орлов', 'Павлов', 'Павловский', 'Панков', 'Панов', 'Петров', 'Пирогов', 'Платонов', 'Плотников', 'Поляков', 'Пономарев', 'Попов', 'Потапов', 'Прокофьев', 'Прохоров', 'Родионов', 'Рожков', 'Романов', 'Русаков', 'Русанов', 'Рыбаков', 'Савельев', 'Савин', 'Сергеев', 'Серов', 'Сидоров', 'Сизов', 'Скворцов', 'Смирнов', 'Снегирев', 'Соболев', 'Соколов', 'Соловьев', 'Сорокин', 'Степанов', 'Сычев', 'Тарасов', 'Титов', 'Тихонов', 'Ткачев', 'Трифонов', 'Уткин', 'Федоров', 'Федотов', 'Фетисов', 'Филиппов',
                   'Фокин', 'Фомин', 'Фомичев', 'Фролов', 'Хомяков', 'Цветков', 'Чесноков', 'Шишкин', 'Юдин', 'Яковлев']
male_third_names = ['Александрович', 'Алексеевич', 'Алиевич', 'Анатольевич', 'Андреевич', 'Антонович', 'Арсентьевич', 'Артёмович', 'Артемьевич', 'Артурович', 'Богданович', 'Борисович', 'Васильевич', 'Витальевич', 'Владимирович', 'Владиславович', 'Всеволодович', 'Вячеславович', 'Георгиевич', 'Глебович', 'Гордеевич', 'Григорьевич', 'Давидович', 'Дамирович', 'Даниилович', 'Данилович', 'Даниэльевич', 'Демидович', 'Денисович', 'Дмитриевич', 'Евгеньевич', 'Егорович', 'Елисеевич', 'Захарович', 'Иванович', 'Игоревич', 'Ильич', 'Кириллович', 'Константинович', 'Леонидович', 'Лукич', 'Львович', 'Макарович', 'Максимович', 'Маркович', 'Марсельевич', 'Матвеевич', 'Миронович', 'Мирославович', 'Михайлович', 'Назарович', 'Никитич', 'Николаевич', 'Олегович', 'Павлович', 'Петрович', 'Платонович', 'Родионович', 'Романович', 'Русланович', 'Семёнович', 'Сергеевич', 'Степанович', 'Тимофеевич', 'Тимурович', 'Фёдорович', 'Юрьевич', 'Яковлевич', 'Янович', 'Ярославович']

female_first_names = ['Агата', 'Агния', 'Аделина', 'Айлин', 'Айша', 'Александра', 'Алёна', 'Алеся', 'Алина', 'Алиса', 'Алия', 'Амелия', 'Амина', 'Анастасия', 'Ангелина', 'Анна', 'Антонина', 'Ариана', 'Арина', 'Асия', 'Валентина', 'Валерия', 'Варвара', 'Василиса', 'Вера', 'Вероника', 'Виктория', 'Владислава', 'Дарья', 'Диана', 'Ева', 'Евгения', 'Екатерина', 'Елизавета', 'Есения', 'Злата', 'Зоя', 'Ирина', 'Кира', 'Кристина', 'Ксения', 'Лейла', 'Лидия', 'Майя', 'Малика', 'Маргарита', 'Марианна', 'Марина', 'Мария', 'Марьям', 'Марьяна', 'Мила', 'Милана', 'Мира', 'Мирослава', 'Надежда', 'Ника', 'Нина', 'Оливия', 'Ольга', 'Полина', 'Сабина', 'Сафия', 'Светлана', 'Серафима', 'София', 'Софья', 'Стефания', 'Таисия', 'Татьяна', 'Теона', 'Ульяна', 'Фатима', 'Эмилия', 'Эмма', 'Юлия', 'Яна', 'Ярослава', 'Ясмина']
female_last_names = ['Абрамова', 'Агафонова', 'Агеева', 'Александрова', 'Алексеева', 'Алешина', 'Андреева', 'Аникина', 'Анисимова', 'Антонова', 'Артамонова', 'Архипова', 'Афанасьева', 'Балашова', 'Басова', 'Белова', 'Белоусова', 'Беляева', 'Бирюкова', 'Борисова', 'Бородина', 'Бочарова', 'Быкова', 'Васильева', 'Верещагина', 'Виноградова', 'Винокурова', 'Вишневская', 'Власова', 'Волкова', 'Воробьева', 'Воронова', 'Гаврилова', 'Галкина', 'Герасимова', 'Глушкова', 'Головина', 'Горбачева', 'Гордеева', 'Горлова', 'Горшкова', 'Грачева', 'Григорьева', 'Гришина', 'Гуляева', 'Гусева', 'Дементьева', 'Демидова', 'Демьянова', 'Денисова', 'Дмитриева', 'Дорофеева', 'Дроздова', 'Дьяконова', 'Егорова', 'Ершова', 'Ефимова', 'Журавлева', 'Зайцева', 'Захарова', 'Зверева', 'Зимина', 'Злобина', 'Золотова', 'Зубова', 'Зуева', 'Иванова', 'Игнатьева', 'Ильина', 'Исаева', 'Казанцева', 'Калашникова', 'Калинина', 'Калмыкова', 'Капустина', 'Киселева', 'Князева', 'Ковалева', 'Кожевникова', 'Козлова', 'Козловская',
                     'Колесникова', 'Колесова', 'Колосова', 'Кольцова', 'Комарова', 'Кондратьева', 'Коновалова', 'Константинова', 'Корнеева', 'Коровина', 'Королева', 'Корчагина', 'Костина', 'Котова', 'Кочеткова', 'Краснова', 'Круглова', 'Крылова', 'Крюкова', 'Кудрявцева', 'Кузнецова', 'Кузьмина', 'Куликова', 'Куприянова', 'Курочкина', 'Лаврова', 'Лазарева', 'Лаптева', 'Лапшина', 'Ларина', 'Лебедева', 'Леонтьева', 'Литвинова', 'Лукьянова', 'Лыкова', 'Макарова', 'Макеева', 'Максимова', 'Малахова', 'Малышева', 'Маркелова', 'Маркина', 'Маркова', 'Мартынова', 'Мельникова', 'Мещерякова', 'Миронова', 'Митрофанова', 'Михайлова', 'Михеева', 'Моисеева', 'Молчанова', 'Морозова', 'Муратова', 'Мухина', 'Назарова', 'Наумова', 'Нестерова', 'Нечаева', 'Никитина', 'Николаева', 'Никонова', 'Новикова', 'Озерова', 'Олейникова', 'Орлова', 'Осипова', 'Павлова', 'Павловская', 'Пантелеева', 'Пахомова', 'Петрова', 'Петровская', 'Пирогова', 'Платонова', 'Плотникова', 'Позднякова', 'Пономарева', 'Попова',
                     'Постникова', 'Прохорова', 'Рогова', 'Родина', 'Рожкова', 'Розанова', 'Романова', 'Рубцова', 'Рудакова', 'Русанова', 'Рыбакова', 'Рябова', 'Савина', 'Сахарова', 'Седова', 'Селезнева', 'Селиванова', 'Семенова', 'Семина', 'Сергеева', 'Сидорова', 'Симонова', 'Ситникова', 'Скворцова', 'Смирнова', 'Соболева', 'Соколова', 'Соловьева', 'Сорокина', 'Старостина', 'Степанова', 'Суслова', 'Суханова', 'Тарасова', 'Терентьева', 'Тимофеева', 'Титова', 'Тихомирова', 'Тихонова', 'Токарева', 'Третьякова', 'Трофимова', 'Устинова', 'Ушакова', 'Фадеева', 'Федорова', 'Федотова', 'Фетисова', 'Филатова', 'Филимонова', 'Филиппова', 'Фомина', 'Фролова', 'Харитонова', 'Цветкова', 'Чеботарева', 'Черная', 'Чернова', 'Черных', 'Черняева', 'Чеснокова', 'Чижова', 'Чумакова', 'Шаповалова', 'Щеглова', 'Щукина', 'Яковлева']
female_third_names = ['Адамовна', 'Александровна', 'Алексеевна', 'Андреевна', 'Антоновна', 'Арсеновна', 'Арсентьевна', 'Артёмовна', 'Артемьевна', 'Артуровна', 'Борисовна', 'Вадимовна', 'Васильевна', 'Викторовна', 'Владимировна', 'Владиславовна', 'Вячеславовна', 'Георгиевна', 'Германовна', 'Глебовна', 'Гордеевна', 'Григорьевна', 'Давидовна', 'Дамировна', 'Данииловна', 'Даниловна', 'Даниэльевна', 'Демидовна', 'Демьяновна', 'Денисовна', 'Дмитриевна', 'Евгеньевна', 'Егоровна', 'Ибрагимовна', 'Ивановна', 'Игоревна', 'Ильинична', 'Кирилловна', 'Константиновна', 'Леонидовна', 'Леоновна', 'Лукинична', 'Львовна', 'Макаровна', 'Максимовна', 'Марковна', 'Матвеевна', 'Мироновна', 'Мирославовна', 'Михайловна', 'Никитична', 'Николаевна', 'Олеговна', 'Павловна', 'Петровна', 'Платоновна', 'Робертовна', 'Родионовна', 'Романовна', 'Руслановна', 'Рустамовна', 'Саввична', 'Савельевна', 'Святославовна', 'Семёновна', 'Сергеевна', 'Степановна', 'Тимофеевна', 'Тимуровна', 'Фёдоровна', 'Филипповна',
                      'Эмильевна', 'Эминовна', 'Юрьевна', 'Яновна', 'Яромировна', 'Ярославовна']

phone_numbers = ['+7(002)151-66-44', '+7(0044)181-49-29', '+7(005)438-41-52', '+7(006)457-26-78', '+7(01)209-49-14', '+7(01)535-07-37', '+7(02)507-71-94', '+7(03)432-47-22', '+7(033)003-82-45', '+7(033)230-24-20', '+7(04)274-65-56', '+7(05)977-68-13', '+7(07)998-52-74', '+7(0731)517-54-22', '+7(0750)207-77-88', '+7(08)905-34-94', '+7(080)873-49-44', '+7(082)754-52-16', '+7(09)455-61-65', '+7(0926)126-12-61', '+7(139)139-55-59', '+7(15)146-02-56', '+7(15)748-89-30', '+7(15)945-72-88', '+7(153)957-98-87', '+7(1535)804-61-22', '+7(1633)861-78-92', '+7(168)208-82-43', '+7(171)293-55-25', '+7(171)517-64-96', '+7(1831)893-87-88', '+7(19)387-77-69', '+7(1902)468-41-98', '+7(1935)624-55-97', '+7(194)746-29-79', '+7(195)723-28-40', '+7(1955)032-38-34', '+7(1990)915-33-75', '+7(21)267-41-11', '+7(21)283-54-63', '+7(210)921-95-35', '+7(2135)395-62-07', '+7(215)562-75-57', '+7(243)275-76-99', '+7(245)541-02-58', '+7(251)804-01-93', '+7(2632)378-59-84', '+7(272)666-20-96', '+7(2782)905-41-94',
                 '+7(28)545-27-26', '+7(28)866-79-23', '+7(280)013-72-95', '+7(2902)547-36-25', '+7(2969)279-09-70', '+7(3073)761-22-44', '+7(31)805-11-26', '+7(321)472-39-30', '+7(3376)261-83-20', '+7(340)125-68-27', '+7(35)794-42-16', '+7(35)957-51-37', '+7(351)409-39-09', '+7(3602)986-10-24', '+7(361)343-87-78', '+7(3612)558-73-36', '+7(3631)422-71-84', '+7(3663)358-66-85', '+7(388)372-41-25', '+7(398)965-88-66', '+7(40)833-82-52', '+7(4029)245-09-03', '+7(404)887-49-25', '+7(408)083-23-77', '+7(41)767-95-82', '+7(4167)144-02-82', '+7(419)463-32-78', '+7(42)526-45-23', '+7(422)167-89-15', '+7(4322)956-58-78', '+7(4340)784-30-05', '+7(4340)816-14-97', '+7(439)539-73-11', '+7(4463)403-27-25', '+7(45)425-71-63', '+7(4541)944-99-32', '+7(46)820-39-14', '+7(4641)713-20-99', '+7(470)689-04-32', '+7(48)658-99-15', '+7(489)347-58-37', '+7(490)704-68-47', '+7(5088)057-78-19', '+7(51)985-38-30', '+7(5139)250-29-12', '+7(517)455-01-40', '+7(5216)581-60-02', '+7(5252)332-39-16',
                 '+7(54)007-35-40', '+7(54)993-02-01', '+7(5409)520-68-89', '+7(544)479-99-95', '+7(548)135-42-76', '+7(55)435-50-66', '+7(55)692-15-44', '+7(5503)180-15-26', '+7(5613)088-61-89', '+7(5660)165-16-82', '+7(57)328-51-28', '+7(5710)278-54-45', '+7(5722)101-80-99', '+7(579)857-74-75', '+7(58)505-66-30', '+7(58)614-58-97', '+7(58)684-56-35', '+7(581)495-93-02', '+7(59)791-51-93', '+7(598)674-99-96', '+7(60)868-97-36', '+7(61)521-31-42', '+7(61)889-95-21', '+7(6173)848-31-36', '+7(6305)145-49-98', '+7(633)075-40-37', '+7(6416)153-10-76', '+7(6471)973-06-10', '+7(65)830-11-83', '+7(650)167-59-78', '+7(651)757-10-11', '+7(6585)467-78-11', '+7(6661)049-38-47', '+7(6689)082-48-19', '+7(677)341-60-79', '+7(680)025-32-40', '+7(6819)704-56-41', '+7(70)538-19-70', '+7(70)641-89-37', '+7(703)668-94-10', '+7(707)834-54-56', '+7(71)629-09-04', '+7(713)340-17-63', '+7(7145)765-02-13', '+7(72)351-83-29', '+7(7277)226-10-48', '+7(730)496-66-49', '+7(7316)828-98-50', '+7(736)518-39-87',
                 '+7(7363)045-96-72', '+7(739)707-90-31', '+7(7484)051-82-86', '+7(75)216-17-44', '+7(76)395-79-69', '+7(76)955-80-13', '+7(766)881-31-40', '+7(7806)571-99-19', '+7(788)791-14-12', '+7(79)725-99-67', '+7(811)951-65-10', '+7(8140)294-90-75', '+7(82)107-52-81', '+7(820)736-23-00', '+7(8243)589-37-07', '+7(8351)627-52-85', '+7(8383)331-62-65', '+7(85)098-75-67', '+7(85)371-47-01', '+7(86)163-02-88', '+7(86)810-27-10', '+7(8635)428-43-15', '+7(8690)093-30-91', '+7(878)858-68-98', '+7(88)133-38-72', '+7(88)417-09-62', '+7(88)852-40-41', '+7(8827)282-32-06', '+7(89)001-01-82', '+7(893)134-85-77', '+7(90)680-30-55', '+7(90)774-62-62', '+7(9025)171-27-31', '+7(91)299-70-54', '+7(9101)964-10-92', '+7(9149)954-09-58', '+7(915)029-76-22', '+7(92)806-08-03', '+7(92)965-40-52', '+7(9215)532-33-38', '+7(94)111-42-66', '+7(947)790-10-00', '+7(95)234-01-79', '+7(9667)275-30-02', '+7(97)165-31-52', '+7(9768)142-36-62', '+7(98)335-79-77', '+7(9820)065-42-79', '+7(984)324-42-58',
                 '+7(9862)424-00-63', '+7(99)771-50-19', '+7(99)952-20-30', '+7(991)977-58-42', '+7(9913)904-96-49']

courses = {'C Sharp':     ['програм.1.C#'],
           '2D графика':  ['2D.1'],
           'Python':      ['програм.1.Python', 'програм.2.Python'],
           '3D графика':  ['3D.1'],
           'Робофабрика': ['Робо1.1', 'Робо1.2', 'Робо1.3', 'Робо2.1', 'Робо2.2'],
           'Android':     ['Android']}


def foormat(val):
    return str(val).lower()


class FigureValues:

    @staticmethod
    def getFIO():
        if round(random()) == 1:
            return choice(male_last_names), choice(male_first_names), choice(male_third_names)
        else:
            return choice(male_last_names), choice(male_first_names), choice(male_third_names)

    @staticmethod
    def getDateBetweenYearsAgo(age_min: int, age_max: int):
        return (datetime.today() - timedelta(days = 365 * randint(age_min, age_max) + randint(10, 365))).date()

    @staticmethod
    def getPhone():
        return choice(phone_numbers)

    @staticmethod
    def getNotes():
        isNotes = random() <= 0.4
        notes = ' '.join(get_sentences(randint(0, 2))).replace("'", '')
        return f'"{notes}"' if isNotes else 'null'

    @staticmethod
    def getPaid():
        isPaid = random() <= 0.8
        return foormat(isPaid)

    @staticmethod
    def getCourseAndGroup():
        course = choice(list(courses.keys()))
        return course, choice(courses[course])

    @staticmethod
    def getMaterialsPaid(course: str):
        isSetPaid = random() <= 0.8
        return foormat(isSetPaid) if course == 'Робофабрика' else 'null'

    @staticmethod
    def getContractStatus():
        chance = random()
        contract_status = ''
        if chance <= .8:
            contract_status = 'Учится'
        elif chance <= .9:
            contract_status = 'Выпущен'
        else:
            contract_status = 'Выпущен'
        return contract_status
